Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/pio/pic32ck2051gc00100.h
#define PIN_PD06H_SQI_CS0                          _UINT32_(102)
#define MUX_PD06H_SQI_CS0                          _UINT32_(7) 
#define PINMUX_PD06H_SQI_CS0                       ((PIN_PD06H_SQI_CS0 << 16) | MUX_PD06H_SQI_CS0)
#define PORT_PD06H_SQI_CS0                         (_UINT32_(1) << 6)

#define PIN_PD05H_SQI_CS1                          _UINT32_(101)
#define MUX_PD05H_SQI_CS1                          _UINT32_(7) 
#define PINMUX_PD05H_SQI_CS1                       ((PIN_PD05H_SQI_CS1 << 16) | MUX_PD05H_SQI_CS1)
#define PORT_PD05H_SQI_CS1                         (_UINT32_(1) << 5)

#define PIN_PA10H_SQI_CS2                          _UINT32_(10)
#define MUX_PA10H_SQI_CS2                          _UINT32_(7) 
#define PINMUX_PA10H_SQI_CS2                       ((PIN_PA10H_SQI_CS2 << 16) | MUX_PA10H_SQI_CS2)
#define PORT_PA10H_SQI_CS2                         (_UINT32_(1) << 10)

#define PIN_PD12H_SQI_CS3                          _UINT32_(108)
#define MUX_PD12H_SQI_CS3                          _UINT32_(7) 
#define PINMUX_PD12H_SQI_CS3                       ((PIN_PD12H_SQI_CS3 << 16) | MUX_PD12H_SQI_CS3)
#define PORT_PD12H_SQI_CS3                         (_UINT32_(1) << 12)

#define PIN_PD07H_SQI_DATA0                        _UINT32_(103)
#define MUX_PD07H_SQI_DATA0                        _UINT32_(7) 
#define PINMUX_PD07H_SQI_DATA0                     ((PIN_PD07H_SQI_DATA0 << 16) | MUX_PD07H_SQI_DATA0)
#define PORT_PD07H_SQI_DATA0                       (_UINT32_(1) << 7)

#define PIN_PD11H_SQI_DATA1                        _UINT32_(107)
#define MUX_PD11H_SQI_DATA1                        _UINT32_(7) 
#define PINMUX_PD11H_SQI_DATA1                     ((PIN_PD11H_SQI_DATA1 << 16) | MUX_PD11H_SQI_DATA1)
#define PORT_PD11H_SQI_DATA1                       (_UINT32_(1) << 11)

#define PIN_PD08H_SQI_DATA2                        _UINT32_(104)
#define MUX_PD08H_SQI_DATA2                        _UINT32_(7) 
#define PINMUX_PD08H_SQI_DATA2                     ((PIN_PD08H_SQI_DATA2 << 16) | MUX_PD08H_SQI_DATA2)
#define PORT_PD08H_SQI_DATA2                       (_UINT32_(1) << 8)

#define PIN_PD09H_SQI_DATA3                        _UINT32_(105)
#define MUX_PD09H_SQI_DATA3                        _UINT32_(7) 
#define PINMUX_PD09H_SQI_DATA3                     ((PIN_PD09H_SQI_DATA3 << 16) | MUX_PD09H_SQI_DATA3)
#define PORT_PD09H_SQI_DATA3                       (_UINT32_(1) << 9)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PB10G_TCC0_WO0                         _UINT32_(42)
#define MUX_PB10G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PB10G_TCC0_WO0                      ((PIN_PB10G_TCC0_WO0 << 16) | MUX_PB10G_TCC0_WO0)
#define PORT_PB10G_TCC0_WO0                        (_UINT32_(1) << 10)

#define PIN_PB04F_TCC0_WO0                         _UINT32_(36)
#define MUX_PB04F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB04F_TCC0_WO0                      ((PIN_PB04F_TCC0_WO0 << 16) | MUX_PB04F_TCC0_WO0)
#define PORT_PB04F_TCC0_WO0                        (_UINT32_(1) << 4)

#define PIN_PC00G_TCC0_WO1                         _UINT32_(64)
#define MUX_PC00G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PC00G_TCC0_WO1                      ((PIN_PC00G_TCC0_WO1 << 16) | MUX_PC00G_TCC0_WO1)
#define PORT_PC00G_TCC0_WO1                        (_UINT32_(1) << 0)

#define PIN_PB05F_TCC0_WO1                         _UINT32_(37)
#define MUX_PB05F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PB05F_TCC0_WO1                      ((PIN_PB05F_TCC0_WO1 << 16) | MUX_PB05F_TCC0_WO1)
#define PORT_PB05F_TCC0_WO1                        (_UINT32_(1) << 5)

#define PIN_PC01G_TCC0_WO2                         _UINT32_(65)
#define MUX_PC01G_TCC0_WO2                         _UINT32_(6) 
#define PINMUX_PC01G_TCC0_WO2                      ((PIN_PC01G_TCC0_WO2 << 16) | MUX_PC01G_TCC0_WO2)
#define PORT_PC01G_TCC0_WO2                        (_UINT32_(1) << 1)

#define PIN_PB13F_TCC0_WO2                         _UINT32_(45)
#define MUX_PB13F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PB13F_TCC0_WO2                      ((PIN_PB13F_TCC0_WO2 << 16) | MUX_PB13F_TCC0_WO2)
#define PORT_PB13F_TCC0_WO2                        (_UINT32_(1) << 13)

#define PIN_PC02G_TCC0_WO3                         _UINT32_(66)
#define MUX_PC02G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PC02G_TCC0_WO3                      ((PIN_PC02G_TCC0_WO3 << 16) | MUX_PC02G_TCC0_WO3)
#define PORT_PC02G_TCC0_WO3                        (_UINT32_(1) << 2)

#define PIN_PB06F_TCC0_WO3                         _UINT32_(38)
#define MUX_PB06F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PB06F_TCC0_WO3                      ((PIN_PB06F_TCC0_WO3 << 16) | MUX_PB06F_TCC0_WO3)
#define PORT_PB06F_TCC0_WO3                        (_UINT32_(1) << 6)

#define PIN_PC03G_TCC0_WO4                         _UINT32_(67)
#define MUX_PC03G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PC03G_TCC0_WO4                      ((PIN_PC03G_TCC0_WO4 << 16) | MUX_PC03G_TCC0_WO4)
#define PORT_PC03G_TCC0_WO4                        (_UINT32_(1) << 3)

#define PIN_PB14F_TCC0_WO4                         _UINT32_(46)
#define MUX_PB14F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PB14F_TCC0_WO4                      ((PIN_PB14F_TCC0_WO4 << 16) | MUX_PB14F_TCC0_WO4)
#define PORT_PB14F_TCC0_WO4                        (_UINT32_(1) << 14)

#define PIN_PC04G_TCC0_WO5                         _UINT32_(68)
#define MUX_PC04G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PC04G_TCC0_WO5                      ((PIN_PC04G_TCC0_WO5 << 16) | MUX_PC04G_TCC0_WO5)
#define PORT_PC04G_TCC0_WO5                        (_UINT32_(1) << 4)

#define PIN_PB15F_TCC0_WO5                         _UINT32_(47)
#define MUX_PB15F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PB15F_TCC0_WO5                      ((PIN_PB15F_TCC0_WO5 << 16) | MUX_PB15F_TCC0_WO5)
#define PORT_PB15F_TCC0_WO5                        (_UINT32_(1) << 15)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PC05G_TCC1_WO0                         _UINT32_(69)
#define MUX_PC05G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PC05G_TCC1_WO0                      ((PIN_PC05G_TCC1_WO0 << 16) | MUX_PC05G_TCC1_WO0)
#define PORT_PC05G_TCC1_WO0                        (_UINT32_(1) << 5)

